##  creating data frame from python dictionary

In [2]:
import pandas as pd

In [8]:
empdata={"empid":[1001,1002,1003,1004,1005],
        "ename":["manju","sri","pavani","devi","lakshmi"],
        "salary":[36000,45000,27000.50,56000,43000],
        "doj":["01-01-2016","03-04-2016","12-06-2015","02-01-2017","02-07-2017"]
        }
 
# convert this dictionary into data frame using dataframe class object

df=pd.DataFrame(empdata)
df

   empid    ename   salary         doj
0   1001    manju  36000.0  01-01-2016
1   1002      sri  45000.0  03-04-2016
2   1003   pavani  27000.5  12-06-2015
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

## creating data frame from python list of tuples

In [5]:
empdata=[(1001,'manju',36000,"01-01-2016"),
        (1002,"sri",45000,"03-04-2016"),
        (1003,"pavani",27000.50,"12-06-2015")
        ]
df2=pd.DataFrame(empdata,columns=["empid","ename","sal","doj"])
df2

   empid   ename      sal         doj
0   1001   manju  36000.0  01-01-2016
1   1002     sri  45000.0  03-04-2016
2   1003  pavani  27000.5  12-06-2015

### Data Extraction : viewing data frame using loc() and iloc()

In [9]:
# To view all rows withonly 'ename' and 'doj' column
df1=df.loc[:,["ename","doj"]]
df1

     ename         doj
0    manju  01-01-2016
1      sri  03-04-2016
2   pavani  12-06-2015
3     devi  02-01-2017
4  lakshmi  02-07-2017

In [10]:
# same data use iloc()
df1=df.iloc[:,[0,2]]
df1

   empid   salary
0   1001  36000.0
1   1002  45000.0
2   1003  27000.5
3   1004  56000.0
4   1005  43000.0

In [14]:
# To view only 0 to 3rd rows of 'ename' and 'doj' column.
df1=df.loc[0:3,["ename","doj"]]
df1

    ename         doj
0   manju  01-01-2016
1     sri  03-04-2016
2  pavani  12-06-2015
3    devi  02-01-2017

In [15]:
# same data use iloc
df1=df.iloc[0:3,[1,3]]
df1

    ename         doj
0   manju  01-01-2016
1     sri  03-04-2016
2  pavani  12-06-2015

In [16]:
df1=df.loc[0:3,:]
df1

   empid   ename   salary         doj
0   1001   manju  36000.0  01-01-2016
1   1002     sri  45000.0  03-04-2016
2   1003  pavani  27000.5  12-06-2015
3   1004    devi  56000.0  02-01-2017

In [18]:
# To view 3rd row to 0th row with all columns. 
df1=df.loc[3:0:-1,:]
df1

   empid   ename   salary         doj
3   1004    devi  56000.0  02-01-2017
2   1003  pavani  27000.5  12-06-2015
1   1002     sri  45000.0  03-04-2016
0   1001   manju  36000.0  01-01-2016

In [19]:
# To retrieve only last row 
df1=df.iloc[-1]
df1

empid           1005
ename        lakshmi
salary       43000.0
doj       02-07-2017
Name: 4, dtype: object

## operations on Data Frame

In [20]:
# knowning no.of rows and columns
df.shape

(5, 4)

In [21]:
# To retrieve only rows or columns from the tuple
r,c=df.shape
print(r)

5

## Retrieving rows from data frame

In [22]:
# head()  will retrieve first 5 rows
df.head()

   empid    ename   salary         doj
0   1001    manju  36000.0  01-01-2016
1   1002      sri  45000.0  03-04-2016
2   1003   pavani  27000.5  12-06-2015
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

In [23]:
df.head(3)

   empid   ename   salary         doj
0   1001   manju  36000.0  01-01-2016
1   1002     sri  45000.0  03-04-2016
2   1003  pavani  27000.5  12-06-2015

In [25]:
# tail() will retrieve last 5 rows
df.tail()

   empid    ename   salary         doj
0   1001    manju  36000.0  01-01-2016
1   1002      sri  45000.0  03-04-2016
2   1003   pavani  27000.5  12-06-2015
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

In [26]:
df.tail(2)

   empid    ename   salary         doj
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

## Retrieving a range of rows

In [27]:
# To display 2nd row to 4th row
df[2:5]

   empid    ename   salary         doj
2   1003   pavani  27000.5  12-06-2015
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

In [28]:
# To display alternate rows
df[0::2]

   empid    ename   salary         doj
0   1001    manju  36000.0  01-01-2016
2   1003   pavani  27000.5  12-06-2015
4   1005  lakshmi  43000.0  02-07-2017

In [29]:
# To display in reverse order
df[4:0:-1]

   empid    ename   salary         doj
4   1005  lakshmi  43000.0  02-07-2017
3   1004     devi  56000.0  02-01-2017
2   1003   pavani  27000.5  12-06-2015
1   1002      sri  45000.0  03-04-2016

## To retrieve columns names

In [30]:
df.columns

Index(['empid', 'ename', 'salary', 'doj'], dtype='object')

In [31]:
## To retrieve column data
df.empid

0    1001
1    1002
2    1003
3    1004
4    1005
Name: empid, dtype: int64

In [32]:
df["empid"]

0    1001
1    1002
2    1003
3    1004
4    1005
Name: empid, dtype: int64

In [33]:
# Retrieving data from multiple columns
df[["empid","ename"]]

   empid    ename
0   1001    manju
1   1002      sri
2   1003   pavani
3   1004     devi
4   1005  lakshmi

In [35]:
# Finding min() and max() values
df["salary"].max()

56000.0

In [36]:
df["salary"].min()

27000.5

In [37]:
### Displaying statistical information
df.describe()

             empid        salary
count     5.000000      5.000000
mean   1003.000000  41400.100000
std       1.581139  10784.080863
min    1001.000000  27000.500000
25%    1002.000000  36000.000000
50%    1003.000000  43000.000000
75%    1004.000000  45000.000000
max    1005.000000  56000.000000

## performing queries on data

In [38]:
# To retrieve employees whose sal is > 40000
df[df.salary>40000]

   empid    ename   salary         doj
1   1002      sri  45000.0  03-04-2016
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017

In [40]:
# To retrieve the row where salary is maximum
df[df.salary==df.salary.max()]

   empid ename   salary         doj
3   1004  devi  56000.0  02-01-2017

In [41]:
# To display multiple columns
# df[[column names]][query]    syntax

df[["empid","ename"]][df.salary>40000]

   empid    ename
1   1002      sri
3   1004     devi
4   1005  lakshmi

In [42]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
# To make 'empid' column as index fot data frame
df1=df.set_index("empid")
df1

         ename   salary         doj
empid
1001     manju  36000.0  01-01-2016
1002       sri  45000.0  03-04-2016
1003    pavani  27000.5  12-06-2015
1004      devi  56000.0  02-01-2017
1005   lakshmi  43000.0  02-07-2017

In [47]:
df

         ename   salary         doj
empid
1001     manju  36000.0  01-01-2016
1002       sri  45000.0  03-04-2016
1003    pavani  27000.5  12-06-2015
1004      devi  56000.0  02-01-2017
1005   lakshmi  43000.0  02-07-2017

In [48]:
# Resetting the index

df.reset_index(inplace=True)
df

   empid    ename   salary         doj
0   1001    manju  36000.0  01-01-2016
1   1002      sri  45000.0  03-04-2016
2   1003   pavani  27000.5  12-06-2015
3   1004     devi  56000.0  02-01-2017
4   1005  lakshmi  43000.0  02-07-2017